wikipedia = {"Історія":
         {"Археологія": (" М. Брайчевський", " О. Коцієвський"),
          "Нумізматика": (" Д. Фрейзер", " А. Бастіан"), },
     "Політика":
         {"Політична психологія": ("О. Майборода", "Филиппов А.В."),
          "Політична соціологія": ("Бацевич Ф. С.", "Є.Захаров"), },
     "Економіка":
         {"Мікроекономіка": ("М. Фрідман", "А. Філіппенко"),
          "Макроекономіка": ("Д. Любченко", "М. Фрідман"), },
     "Традиції":
         {"Українські": ("М. Левитський", "Ю. Юзич"),
          "Військові": ("В. Куін", "Г. Шумським"), },
     "Кінематографія":
         {"Каскадери": ("Ю. Бріннер", "Д. Дар"),
          "Кінооператори": ("Е. Лесні", "Луї Ле Пренс"), },
     "Персоналії":
         {"Зниклі": ("У. Абель", "Г. Лінгнер"),
          "Довгожителі": ("Г. Бейнс", "Х. Тійоно"), },
     "Література":
         {"Поети": ("Л. Костенко", "О. Олесь"),
          "Анти-утопія": ("Дж. Орвел", "Дж. Байрон"), },
     "Міста":
         {"Мегаполіси": ("Й. Матонго", "Д. Кроун"), },
     "Міфологія":
         {"Первісна": ("К. Рад", "М. Сіліліус"),
          "Сучасна": ("Клод Леві-Строс", "Б. Лобовик"), },
     "Мова":
         {"Синхронія": ("Фердинанд де Сосюр", "Бодуен де Куртене"),
          "Діахронія": ("Ян Бодуен де Куртене", "В. І. Даль"), },
     }


def choice_of_category(dictionary):
    for category in dictionary:
        print("        ", category)


choice_of_category(wikipedia)
chapter = str(input("Виберіть категорію: ").capitalize())

choice_of_category(wikipedia[chapter])
subchapter = str(input('Виберіть підкатегорію: ').capitalize())

for name in range(0, len(wikipedia[chapter][subchapter])):
    print("{}".format(wikipedia[chapter][subchapter][name]))
